Repository: common-repository/one-click-lightbox
Catalog: languages/one-click-lightbox-*.po
Languages: de_de

source: Picture %1 of %2
de_de: Bild %1 von %2

source: One Click Lightbox Options
de_de: One Click Lightbox Einstellungen

source: Transparency Error: Please enter a valid number between 0.0 and 1.0. Resetting value to default: 0.8
de_de: Transparenz Fehler: Bitte eine Zahl zwischen 0.0 und 1.0 eingeben. Setze Wert auf den Standartwert zurück: 0.8.

source: You have two ways to enable the lightbox:
de_de: Es gibt zwei Varianten die Lightbox zu aktivieren:

source: #1 - If you want the Lightbox for a small amount of images
de_de: #1 - Wenn du die Lightbox nur für ein paar wenige Bilder benötigst

source: You manually add this attribute <code>data-lightbox="roadtrip"</code> to all anchors that point to an image.
de_de: Füge einfach <code>data-lightbox="roadtrip"</code> allen deinen Ankern manuell zu. Die Anker müssen auf eine Bilddatei zeigen.

source: Example: <code>&lt;a href="link-to-your-image.jpg" data-lightbox="roadtrip"&gt;Here is your content, maybe an &lt;img&gt;-tag or whatever&lt;/a&gt;</code>
de_de: Beispiel: <code>&lt;a href="link-zu-deinem-Bild.jpg" data-lightbox="roadtrip"&gt;Hier ist dein Inhalt, vielleicht ein &lt;img&gt;-tag oder etwas anderes&lt;/a&gt;</code>

source: #2 - If you need the Lightbox for every image
de_de: #2 - Wenn du die Lightbox für alle Bilder möchtest

source: You check the following checkbox. That will automatically add the attribute from above to all anchors that point to an image.
de_de: Setze einen Haken bei der nachfolgenden Checkbox. Dadurch wird automatisch allen Ankern, die auf ein Bild zeigen, das oben genannte Attribut zugefügt.

source: If that should not work for you, you can simply add <code>data-lightbox="roadtrip"</code> to the specific anchor. Normally that should not be necessary.
de_de: Falls das für dich nicht funktionieren sollte, kannst du einfach <code>data-lightbox="roadtrip"</code> zu den jeweiligen Ankern hinzufügen. Das sollte aber normalerweise nicht notwendig sein.

source: It is also possible to deactivate the Lightbox for specific images. Simply add <code>class="no-lightbox"</code> to your anchor like this: <pre><code>&lt;a href="link-to-your-image.jpg" class="no-lightbox"&gt;Here is your content&lt;/a&gt;</code></pre>
de_de: Es ist außerdem möglich, die Lightbox für bestimmte Bilder zu deaktiveren. Dafür fügst du ganz einfach <code>class="no-lightbox"</code> in den Anker mit deinem Link ein. Das sollte dann so aussehen: <pre><code>&lt;a href="link-zu-deinem-Bild.jpg" class="no-lightbox"&gt;Hier ist dein Inhalt&lt;/a&gt;</code></pre>

source: Activate to add data-lightbox="roadtrip" to every anchor automatically:
de_de: Aktivieren, um automatisch data-lightbox="roadtrip" allen Ankern hinzuzufügen:

source: For Advanced Users only!
de_de: Nur für erfahrene Benutzer!

source: Transparency (between 0.0 and 1.0):
de_de: Transparenz (zwischen 0.0 und 1.0):

source: Adds a lightbox to your site
de_de: Fügt der Seite eine Lightbox hinzu
